In [1]:
import pandas as pd

In [2]:
df1=pd.read_csv(r"C:\Users\Juliane\Documents\GitHub\labs_repo\Sharks\c2119.csv")
df2=pd.read_csv(r"C:\Users\Juliane\Documents\GitHub\labs_repo\Sharks\c2228.csv")
print (df1)

     Pos                     Name       Value
0      1                    China  1367485388
1      2                    India  1251695584
2      3           European Union   513949445
3      4            United States   321368864
4      5                Indonesia   255993674
..   ...                      ...         ...
233  234                  Tokelau        1337
234  235                     Niue        1190
235  236  Holy See (Vatican City)         842
236  237  Cocos (Keeling) Islands         596
237  238         Pitcairn Islands          48

[238 rows x 3 columns]

In [3]:
df1.head(3)

   Pos            Name       Value
0    1           China  1367485388
1    2           India  1251695584
2    3  European Union   513949445

In [4]:
df2.head(3)

   Pos            Name  Value
0    1  American Samoa   74.6
1    2           Nauru   71.1
2    3    Cook Islands   63.7

In [5]:
df1.columns

Index(['Pos', 'Name', 'Value'], dtype='object')

In [6]:
comb_df = pd.concat([df1, df2], ignore_index=True)

In [7]:
df1.rename(columns={"Name": "Country", "Value": "Population"}, inplace=True)
df2.rename(columns={"Name": "Country", "Value": "Obesity Rate"}, inplace=True)

In [17]:
comb_df = pd.merge(df1, df2,on="Country", how="inner")

In [18]:
comb_df

     Pos_x                Country  Population  Pos_y  Obesity Rate
0        1                  China  1367485388    152           5.7
1        2                  India  1251695584    184           1.9
2        4          United States   321368864     18          33.0
3        5              Indonesia   255993674    160           4.8
4        6                 Brazil   204259812    102          18.8
..     ...                    ...         ...    ...           ...
186    210  Saint Kitts and Nevis       51936     11          40.7
187    220                  Palau       21265      7          48.9
188    224           Cook Islands        9838      3          63.7
189    225                  Nauru        9540      2          71.1
190    234                Tokelau        1337      4          63.4

[191 rows x 5 columns]

In [19]:
# Select countries with obesity rates higher than 20 percent and populations larger than 10,000,000 (107)

filt = comb_df[(comb_df["Obesity Rate"]>1) & (comb_df["Population"]> 10000000)]

In [20]:
filt

    Pos_x             Country  Population  Pos_y  Obesity Rate
0       1               China  1367485388    152           5.7
1       2               India  1251695584    184           1.9
2       4       United States   321368864     18          33.0
3       5           Indonesia   255993674    160           4.8
4       6              Brazil   204259812    102          18.8
..    ...                 ...         ...    ...           ...
81     85      Czech Republic    10644842     21          32.7
82     86             Somalia    10616380    162           4.8
83     87  Dominican Republic    10478756     90          21.2
84     88               Benin    10448647    151           6.0
85     89               Haiti    10110019    137           7.9

[86 rows x 5 columns]

In [21]:
sort = filt.sort_values(by ='Obesity Rate', ascending=False)

In [23]:
sort.head(3)

    Pos_x        Country  Population  Pos_y  Obesity Rate
14     16          Egypt    88487396     17          33.1
2       4  United States   321368864     18          33.0
45     47   Saudi Arabia    27752316     19          33.0

In [22]:
top_10 = sort.value_counts().reset_index()
top_10.head(3)

   Pos_x    Country  Population  Pos_y  Obesity Rate  0
0      1      China  1367485388    152           5.7  1
1     57  Sri Lanka    22053488    155           5.1  1
2     65      Syria    17064854     41          27.1  1

In [ ]:
Index the result from 1-10
Return the dataframe.

In [ ]:
def analyze('df1', 'df2'):
    pd.series
    # Select only the "Country" and "Population" columns from the population dataframe
    population_data = population_data[["Country", "Population"]]

    # Select only the "Country" and "Obesity Rate" columns from the obesity dataframe
    obesity_data = obesity_data[["Country", "Obesity Rate"]]

    return population_data, obesity_data

In [ ]:
analyze()

In [ ]:
# Rename columns in each DataFrame if needed
df1.rename(columns={"Name": "Country", "2021": "Population", "Obesity Rate": "Obesity Rate"}, inplace=True)
df2.rename(columns={"Name": "Country", "2021": "Population", "Obesity Rate": "Obesity Rate"}, inplace=True)

# Concatenate the two DataFrames to combine them
combined_df = pd.concat([df1, df2], ignore_index=True)

# Display the resulting DataFrame
print(combined_df)

In [ ]:
df.index =